src/main/resources/getAllBooksRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.soap.com/jaxb">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAllBooksRequest/>
    </soapenv:Body>
</soapenv:Envelope>